Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/SYSTICK_356.0.xml
<module id="SYSTICK" HW_revision="356.0">
    <register id="STCSR" width="32" offset="0x10" internal="0" description="SysTick Control and Status Register">
        <bitfield id="ENABLE" description="Enable SysTick counter" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="First" value="0x0" description="Counter disabled"/>
        </bitfield>
        <bitfield id="TICKINT" description="" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="VAL_0" value="0x0" description="Counting down to zero does not pend the SysTick handler. Software can use COUNTFLAG to determine if the SysTick handler has ever counted to zero."/>
            <bitenum id="VAL_1" value="0x1" description="Counting down to zero pends the SysTick handler."/>
        </bitfield>
        <bitfield id="CLKSOURCE" description="Clock source." begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="VAL_0" value="0x0" description="Not applicable"/>
            <bitenum id="VAL_1" value="0x1" description="Core clock"/>
        </bitfield>
        <bitfield id="COUNTFLAG" description="Returns 1 if timer counted to 0 since last time this was read. Clears on read by application of any part of the SysTick Control and Status Register. If read by the debugger using the DAP, this bit is cleared on read-only if the MasterType bit in the AHB-AP Control Register is set to 0. Otherwise, the COUNTFLAG bit is not changed by the debugger read." begin="16" end="16" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="STRVR" width="32" offset="0x14" internal="0" description="SysTick Reload Value Register">
        <bitfield id="RELOAD" description="Value to load into the SysTick Current Value Register when the counter reaches 0." begin="23" end="0" width="24" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="STCVR" width="32" offset="0x18" internal="0" description="SysTick Current Value Register">
        <bitfield id="CURRENT" description="Current value at the time the register is accessed. No read-modify-write protection is provided, so change with care. Writing to it with any value clears the register to 0. Clearing this register also clears the COUNTFLAG bit of the SysTick Control and Status Register." begin="23" end="0" width="24" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="STCR" width="32" offset="0x1C" internal="0" description="SysTick Calibration Value Register">
        <bitfield id="TENMS" description="Reads as zero. Indicates calibration value is not known." begin="23" end="0" width="24" rwaccess="R">
        </bitfield>
        <bitfield id="SKEW" description="Reads as one. The calibration value is not exactly 10ms because of clock frequency. This could affect its suitability as a software real time clock." begin="30" end="30" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="NOREF" description="Reads as one. Indicates that no separate reference clock is provided." begin="31" end="31" width="1" rwaccess="R">
        </bitfield>
    </register>
</module>
